---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepWallJoinToRoof
source: html/3e13b33f-4468-9c86-94c3-253faf272ae8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepWallJoinToRoof Property

Can't keep wall and [target] joined

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotKeepWallJoinToRoof { get; }
```